app/views/matches/index.html.erb

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
---
	<%
		p1 = Player.find(m.player1_id)