app/views/matches/new.html.erb


			<%= collection_select( :match, :player1_id, Player.all, :id, :name, {include_blank: 'Select Player'},{:class => 'required', :title=>'Please select a player'}) %>
---
SELECT "players".* FROM "players"