app/views/matches/show.html.erb

				<!-- Games Loop -->
				<% @match.games.each do |game|%>
---
SELECT "games".* FROM "games" WHERE "games"."match_id" = ?  [["match_id", 6]]