app/controllers/matches_controller.rb

SELECT "players".* FROM "players"
---
	def new
		@players = Player.all