app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"  ORDER BY "matches"."id" DESC
---
	def index
		@matches = Match.all.order(id: :desc)

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@match = Match.find(params[:id])
		# TODO: change id to Player object?
		@p1 = Player.find(@match.player1_id)

INSERT INTO "matches" ("created_at", "player1_id", "player2_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-09-27 05:13:15.191456"], ["player1_id", 1], ["player2_id", 1], ["updated_at", "2015-09-27 05:13:15.191456"]]
---
	def create
		# render plain: match_params
		# create new match
		@match = Match.new(match_params)
		if (@match.save)