app/controllers/players_controller.rb

	def index
		@players = Player.all
---
SELECT  "players".* FROM "players"  ORDER BY "players"."id" ASC LIMIT 1

	def create
		@player = Player.new(player_params)

		if (@player.save)
---
INSERT INTO "players" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-23 23:44:54.597455"], ["name", "Edan"], ["updated_at", "2014-11-23 23:44:54.597455"]]

	def update
		@player = Player.find(params[:id])

		if (@player.update(player_params))
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "players" SET "name" = ?, "updated_at" = ? WHERE "players"."id" = 1  [["name", "Eda"], ["updated_at", "2014-11-24 00:46:50.750862"]]